Tekla.Structures.Drawing.Arc.ArcAttributes
The ArcAttributes class is the attributes class for the arc.

Tekla.Structures.Drawing.Arc.ArcAttributes.#ctor(System.Boolean)
Creates a new default attributes instance that doesn't load attributes.

Tekla.Structures.Drawing.Arc.ArcAttributes.#ctor
Creates a new default arc attributes instance that loads standard attributes.

Tekla.Structures.Drawing.Arc.ArcAttributes.#ctor(System.String)
Creates a new arc attributes instance that loads the specified attributes.
AttributesFile: The filename of the attributes file.

Tekla.Structures.Drawing.Arc.ArcAttributes.LoadAttributes(System.String)
Loads the attributes from the attribute file.
AttributeFile: The filename of the attribute file.
Returns: True if the attributes are loaded correctly. False if the attribute file loading failed.

Tekla.Structures.Drawing.Arc.ArcAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.